Catalogs/СообщенияИнтегрированныхСистем.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.4">
	<Catalog>
		<Properties>
			<Name>СообщенияИнтегрированныхСистем</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Входящее</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДанныеСообщения</Name>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаОбработки</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаСоздания</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВОтветНа</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СообщенияИнтегрированныхСистем</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИдентификаторСообщения</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>150</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Очередь</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ОчередиСообщенийИнтегрированныхСистем</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

CommonModules/ОбработкаСообщенийИнтегрированныхСистем/Ext/Module.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

Процедура ОбработатьСообщениеИнтегрированныхСистем(СообщениеСсылка) Экспорт
	
	Попытка
		
		СтрокаXML = СообщениеСсылка.ДанныеСообщения.Получить();
		ЧтениеXML = Новый ЧтениеXML;
		ЧтениеXML.УстановитьСтроку(СтрокаXML);
		
		СообщениеXDTO = ФабрикаXDTO.ПрочитатьXML(ЧтениеXML);
		
		ОтветноеСообщение = ОбработкаЗапросовXDTO.ОбработатьУниверсальноеСообщение(СообщениеXDTO);
		ОтветноеСообщение.initialMessageID = СообщениеXDTO.messageID;
		ОтветноеСообщение.messageID = Строка(Новый УникальныйИдентификатор);
		
		УстановитьПривилегированныйРежим(Истина);
		НачатьТранзакцию();
		СообщениеОбъект = СообщениеСсылка.ПолучитьОбъект();
		СообщениеОбъект.Заблокировать();
		СообщениеОбъект.Записать();
		СообщениеОбъект.УстановитьПометкуУдаления(Истина);
		
		СтрокаXML = "";
		ЗаписьXML = Новый ЗаписьXML;
		ЗаписьXML.УстановитьСтроку();
		ФабрикаXDTO.ЗаписатьXML(ЗаписьXML, ОтветноеСообщение, , , , НазначениеТипаXML.Явное);
		СтрокаXML = ЗаписьXML.Закрыть();
		
		СообщениеОбъект = Справочники.СообщенияИнтегрированныхСистем.СоздатьЭлемент();
		СообщениеОбъект.ДанныеСообщения = Новый ХранилищеЗначения(СтрокаXML);
		СообщениеОбъект.Входящее = Ложь;
		СообщениеОбъект.ДатаСоздания = ТекущаяДата();
		СообщениеОбъект.Очередь = СообщениеСсылка.Очередь;
		СообщениеОбъект.Код = Строка(ОтветноеСообщение.Тип());
		СообщениеОбъект.ИдентификаторСообщения = ОтветноеСообщение.messageID;
		СообщениеОбъект.ВОтветНа = СообщениеСсылка;
		СообщениеОбъект.Записать();
		ЗафиксироватьТранзакцию();

	Исключение
		
		ЗаписьЖурналаРегистрации(НСтр("ru = 'Обработка сообщения интегрированных систем'; en = 'Integrated system messages processing'",
				ОбщегоНазначенияКлиентСервер.КодОсновногоЯзыка()), 
			УровеньЖурналаРегистрации.Ошибка,,, 
			ПодробноеПредставлениеОшибки(ИнформацияОбОшибке()));
		
	КонецПопытки;	
	
КонецПроцедуры

#КонецОбласти

#КонецЕсли
